{"name": "Garlic Basil Grilled Chicken Pizza Sliders 🥩", "description": "<a href=\"https://www.instagram.com/tayoscreation/\">Tayo Ola</a> shows us how to put a fun twist on pizza night with these delicious, easy garlic basil grilled chicken pizza sliders.", "prep_time_minutes": 10, "total_time_minutes": 30, "num_servings": 6, "nutrition": {"calories": 288, "carbohydrates": 6, "fat": 21, "fiber": 0, "protein": 17, "sugar": 2, "updated_at": "2024-05-01T08:03:44+02:00"}, "thumbnail_url": "https://img.buzzfeed.com/tasty-app-user-assets-prod-us-east-1/recipes/95ae0f69d5614444b721ff0e2e4ebb25.jpeg", "instructions": ["Preheat the oven to 350°F (180°C). Line a baking sheet with foil and grease with nonstick spray.", "Season both sides of the chicken thighs with a pinch of salt and pepper.  Grill for 2–3 minutes per side, until golden brown. Remove from the grill and let cool slightly, then slice into strips.", "Cut the sheet of slider rolls in half to separate the top and bottom, leaving the individual rolls intact. Transfer the bottom rolls to the prepared baking sheet and sprinkle evenly with half of the shredded Italian cheese, then dollop half of the marinara sauce on top. Top with the pepperoni, then the remaining ½ cup shredded Italian cheese, ½ cup marinara sauce, and the sliced grilled chicken. Place the top slider rolls on top.", "Cover the sliders with foil, then transfer to the oven and bake for about 15 minutes, until the cheese has melted.", "While the sliders bake, make the garlic basil butter,: In a small microwave-safe bowl, combine the garlic, butter, and basil. Microwave for 30 seconds, until the butter is melted. Stir to combine.", "Remove the sliders from the oven, uncover, and spoon some of the garlic basil butter on top, then sprinkle with the red pepper flakes and dried Italian seasoning. Return the oven and bake for 5 minutes more, until the top is golden brown.", "Brush with the remaining garlic basil butter, then serve immediately, slicing between the rolls or pulling apart to separate into individual sliders.", "Enjoy!"]}