{"name": "Low-Carb Mediterranean Chicken And Tomato By Kevin Curry", "description": "Kevin Curry of @fitmencook shows us how to make one of his favorite keto-friendly dishes. Sear off chicken thighs and then stir up a creamy sun-dried tomato sauce, all in the same pan! Feel free to customize this recipe to your own liking by swapping out the chicken thighs for chicken breasts or shrimp and using light coconut milk instead of heavy cream.", "prep_time_minutes": 10, "total_time_minutes": 30, "num_servings": 4, "nutrition": {"calories": 458, "carbohydrates": 12, "fat": 35, "fiber": 1, "protein": 34, "sugar": 7, "updated_at": "2024-05-01T08:04:39+02:00"}, "thumbnail_url": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/258856.jpg", "instructions": ["Preheat the oven to 350°F (180°C).", "Season the chicken thighs on both sides with ½ teaspoon salt and ¼ teaspoon black pepper.", "Heat a 10-inch cast iron skillet over high heat. Once the skillet is hot, add the olive oil and the chicken thighs.  Cook for 3–4 minutes, or until the edges are seared.  Remove the chicken from the skillet and transfer to a clean plate.", "Reduce the heat to medium-low.  Add the garlic thyme, and rosemary to the pan and sauté for 2–3 minutes, until fragrant.", "Pour in the chicken stock, then add the sun-dried tomatoes and heavy cream. Season with the remaining ½ teaspoon salt and ¼ teaspoon pepper. Bring to a simmer and cook for 1–2 minutes, to let the flavors meld, then add the Parmesan cheese and stir until melted.", "Return the chicken thighs to the skillet, nestling into the sauce. Drizzle some of the sauce over the chicken.", "Transfer the skillet to the oven and bake for 15 minutes until the chicken is cooked through.", "Remove from the oven and let sit for 5 minutes, until cooled slightly and the sauce thickens.", "Garnish with the parsley, then serve the chicken over cauliflower rice with more sauce spooned on top.", "Enjoy!"]}